In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## 1. 결측치 표현 및 확인

In [4]:
float_data = Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [5]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data = Series(["aardvark", np.nan, None, "avocado"])
string_data
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [7]:
float_data = Series([1, 2, None])
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [8]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

## 2. 결측치 골라내기

In [9]:
data = Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data.dropna()  #default는 how='any' axis='index'

     0    1    2
0  1.0  6.5  3.0

### how

In [14]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

### axis

In [16]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

### thresh

In [17]:
df = DataFrame(np.random.standard_normal((7, 3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -1.603173       NaN       NaN
1  1.049668       NaN       NaN
2  0.352031       NaN -0.762837
3  0.579763       NaN  0.277343
4 -0.311857  2.079533  1.365187
5  0.266468  0.585797 -0.278460
6  1.215473  2.318563 -1.435097

In [18]:
df.dropna()
df.dropna(thresh=2)

          0         1         2
2  0.352031       NaN -0.762837
3  0.579763       NaN  0.277343
4 -0.311857  2.079533  1.365187
5  0.266468  0.585797 -0.278460
6  1.215473  2.318563 -1.435097

## 3. 결측치 채우기

In [19]:
df

          0         1         2
0 -1.603173       NaN       NaN
1  1.049668       NaN       NaN
2  0.352031       NaN -0.762837
3  0.579763       NaN  0.277343
4 -0.311857  2.079533  1.365187
5  0.266468  0.585797 -0.278460
6  1.215473  2.318563 -1.435097

In [20]:
df.fillna(0)

          0         1         2
0 -1.603173  0.000000  0.000000
1  1.049668  0.000000  0.000000
2  0.352031  0.000000 -0.762837
3  0.579763  0.000000  0.277343
4 -0.311857  2.079533  1.365187
5  0.266468  0.585797 -0.278460
6  1.215473  2.318563 -1.435097

### 딕셔너리를 통한 행 별 다른 결측치 채우기

In [21]:
df

          0         1         2
0 -1.603173       NaN       NaN
1  1.049668       NaN       NaN
2  0.352031       NaN -0.762837
3  0.579763       NaN  0.277343
4 -0.311857  2.079533  1.365187
5  0.266468  0.585797 -0.278460
6  1.215473  2.318563 -1.435097

In [22]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.603173  0.500000  0.000000
1  1.049668  0.500000  0.000000
2  0.352031  0.500000 -0.762837
3  0.579763  0.500000  0.277343
4 -0.311857  2.079533  1.365187
5  0.266468  0.585797 -0.278460
6  1.215473  2.318563 -1.435097

### method

In [24]:
df = DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  0.938891 -0.425154 -0.302078
1  1.044674 -0.714317 -2.208426
2 -0.765645       NaN  1.454243
3 -0.487685       NaN  0.258148
4 -0.988138       NaN       NaN
5 -0.261799       NaN       NaN

In [25]:
df.fillna(method="ffill")

          0         1         2
0  0.938891 -0.425154 -0.302078
1  1.044674 -0.714317 -2.208426
2 -0.765645 -0.714317  1.454243
3 -0.487685 -0.714317  0.258148
4 -0.988138 -0.714317  0.258148
5 -0.261799 -0.714317  0.258148

In [26]:
df.fillna(method="ffill", limit=2)

          0         1         2
0  0.938891 -0.425154 -0.302078
1  1.044674 -0.714317 -2.208426
2 -0.765645 -0.714317  1.454243
3 -0.487685 -0.714317  0.258148
4 -0.988138       NaN  0.258148
5 -0.261799       NaN  0.258148

In [27]:
data = Series([1., np.nan, 3.5, np.nan, 7])

In [28]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 4. 함수나 맵핑을 이용하여 데이터 변형

In [39]:
data = DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [40]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [41]:
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [42]:
def get_animal(x):
    return meat_to_animal[x]
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [43]:
df = DataFrame(np.random.standard_normal((7, 3)))

In [45]:
df

          0         1         2
0 -0.726213  0.222896  0.051316
1 -1.157719  0.816707  0.433610
2  1.010737  1.824875 -0.997518
3  0.850591 -0.131578  0.912414
4  0.188211  2.169461 -0.114928
5  2.003697  0.029610  0.795253
6  0.118110 -0.748532  0.584970

In [44]:
df.applymap(lambda x:x**2)

          0         1         2
0  0.527386  0.049682  0.002633
1  1.340314  0.667010  0.188017
2  1.021589  3.330170  0.995043
3  0.723505  0.017313  0.832500
4  0.035423  4.706563  0.013208
5  4.014803  0.000877  0.632428
6  0.013950  0.560299  0.342190

## 5. 값 치환하기

In [46]:
data = Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [47]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [48]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [49]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [50]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## 6. 축 색인 이름 바꾸기

### map

In [51]:
data = DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])

In [52]:
def transform(x):
    return x[:4].upper()

data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [53]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [55]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

### rename

In [58]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [59]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [60]:
data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

## 7. 이산화

In [61]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [63]:
bins = [18, 25, 35, 60, 100]
age_categories = pd.cut(ages, bins)
age_categories

0      (18, 25]
1      (18, 25]
2      (18, 25]
3      (25, 35]
4      (18, 25]
5      (18, 25]
6      (35, 60]
7      (25, 35]
8     (60, 100]
9      (35, 60]
10     (35, 60]
11     (25, 35]
dtype: category
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [65]:
pd.cut(ages, bins, right=False)

0      [18, 25)
1      [18, 25)
2      [25, 35)
3      [25, 35)
4      [18, 25)
5      [18, 25)
6      [35, 60)
7      [25, 35)
8     [60, 100)
9      [35, 60)
10     [35, 60)
11     [25, 35)
dtype: category
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [66]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)

0          Youth
1          Youth
2          Youth
3     YoungAdult
4          Youth
5          Youth
6     MiddleAged
7     YoungAdult
8         Senior
9     MiddleAged
10    MiddleAged
11    YoungAdult
dtype: category
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [67]:
data = np.random.uniform(size=20)

In [68]:
pd.cut(data, 4, precision=2)

[(0.24, 0.46], (0.24, 0.46], (0.014, 0.24], (0.46, 0.69], (0.46, 0.69], ..., (0.46, 0.69], (0.24, 0.46], (0.014, 0.24], (0.014, 0.24], (0.69, 0.91]]
Length: 20
Categories (4, interval[float64]): [(0.014, 0.24] < (0.24, 0.46] < (0.46, 0.69] < (0.69, 0.91]]

In [73]:
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data,4, precision=2)
quartiles
pd.value_counts(quartiles)

(-3.5599999999999996, -0.64]    250
(-0.64, -0.026]                 250
(-0.026, 0.71]                  250
(0.71, 3.37]                    250
dtype: int64

In [74]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.55, -1.291]      100
(-1.291, -0.0264]    400
(-0.0264, 1.275]     400
(1.275, 3.367]       100
dtype: int64

## 8. 이상치를 찾고 제외

In [29]:
data = DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.062161     0.065081     0.039847     0.011041
std       0.989286     0.965537     1.030176     1.021332
min      -3.597232    -3.727419    -3.684927    -3.613697
25%      -0.577558    -0.540543    -0.604396    -0.642437
50%       0.088956     0.041769     0.080646     0.008462
75%       0.708209     0.700531     0.723212     0.705792
max       2.863999     2.856338     3.237695     3.342250

In [31]:
data.abs() > 3

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

In [42]:
(data.abs() > 3).any(axis="columns")

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [45]:
data.loc[~(data.abs() > 3).any(axis="columns"),:]

            0         1         2         3
0   -0.501534  1.003818  0.046085  0.710430
1    0.422604  0.592961 -0.724357  0.203795
2   -0.602690  0.117457 -1.276861 -0.117716
3   -0.581858  1.136492  0.726221  0.599811
4   -2.056945 -0.060868 -0.325527  0.347037
..        ...       ...       ...       ...
995  0.657130 -0.914343  0.231204  0.584184
996 -0.573498 -0.681554  0.819127 -0.585885
997 -0.437305 -0.983939 -0.451184  0.633076
998  1.394884 -0.145596 -0.260882  0.921621
999  0.472919  0.060923 -0.012640  0.548377

[988 rows x 4 columns]

In [43]:
data.drop(data.index[(data.abs() > 3).any(axis="columns")])

            0         1         2         3
0   -0.501534  1.003818  0.046085  0.710430
1    0.422604  0.592961 -0.724357  0.203795
2   -0.602690  0.117457 -1.276861 -0.117716
3   -0.581858  1.136492  0.726221  0.599811
4   -2.056945 -0.060868 -0.325527  0.347037
..        ...       ...       ...       ...
995  0.657130 -0.914343  0.231204  0.584184
996 -0.573498 -0.681554  0.819127 -0.585885
997 -0.437305 -0.983939 -0.451184  0.633076
998  1.394884 -0.145596 -0.260882  0.921621
999  0.472919  0.060923 -0.012640  0.548377

[988 rows x 4 columns]

In [79]:
np.sign(data) * 3

       0    1    2    3
0   -3.0  3.0  3.0  3.0
1    3.0 -3.0  3.0  3.0
2    3.0 -3.0  3.0  3.0
3    3.0 -3.0  3.0  3.0
4    3.0  3.0  3.0  3.0
..   ...  ...  ...  ...
995 -3.0  3.0 -3.0  3.0
996  3.0  3.0 -3.0  3.0
997 -3.0  3.0  3.0  3.0
998  3.0 -3.0 -3.0 -3.0
999 -3.0 -3.0 -3.0  3.0

[1000 rows x 4 columns]

In [80]:
data[data.abs() > 3]=np.sign(data) * 3

In [81]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.009074    -0.012517    -0.036146    -0.018395
std       1.025656     0.995959     0.953506     0.980285
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.719824    -0.694020    -0.701202    -0.697479
50%       0.031774     0.002280    -0.045684     0.007335
75%       0.681335     0.671200     0.625358     0.613225
max       3.000000     3.000000     3.000000     2.859053

## 9. 더미 변수 계산하기

In [85]:
df = DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [86]:
pd.get_dummies(df["key"], dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [87]:
dummies = pd.get_dummies(df["key"], prefix="key", dtype=float)

In [88]:
dummies

   key_a  key_b  key_c
0    0.0    1.0    0.0
1    0.0    1.0    0.0
2    1.0    0.0    0.0
3    0.0    0.0    1.0
4    1.0    0.0    0.0
5    0.0    1.0    0.0

In [92]:
df_with_dummy = pd.concat([df[["data1"]],dummies],axis=1)
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [46]:
values = np.random.uniform(size=10)
values

array([0.43004294, 0.929921  , 0.05879203, 0.30576974, 0.58962475,
       0.62138205, 0.96023056, 0.26976591, 0.95443954, 0.07406111])

In [47]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.cut(values, bins,labels=['a','b','c','d','e'])

['c', 'e', 'a', 'b', 'c', 'd', 'e', 'b', 'e', 'a']
Categories (5, object): ['a' < 'b' < 'c' < 'd' < 'e']

In [48]:
pd.get_dummies(pd.cut(values, bins,labels=['a','b','c','d','e']))

       a      b      c      d      e
0  False  False   True  False  False
1  False  False  False  False   True
2   True  False  False  False  False
3  False   True  False  False  False
4  False  False   True  False  False
5  False  False  False   True  False
6  False  False  False  False   True
7  False   True  False  False  False
8  False  False  False  False   True
9   True  False  False  False  False

In [49]:
pd.get_dummies(pd.cut(values, bins,labels=['a','b','c','d','e']),dtype=int)

   a  b  c  d  e
0  0  0  1  0  0
1  0  0  0  0  1
2  1  0  0  0  0
3  0  1  0  0  0
4  0  0  1  0  0
5  0  0  0  1  0
6  0  0  0  0  1
7  0  1  0  0  0
8  0  0  0  0  1
9  1  0  0  0  0